nginx.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.99.100 (be patient)


Server Software:        Apache/2.2.31
Server Hostname:        192.168.99.100
Server Port:            8081

Document Path:          /
Document Length:        92919 bytes

Concurrency Level:      100
Time taken for tests:   3.003 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      93201000 bytes
HTML transferred:       92919000 bytes
Requests per second:    333.00 [#/sec] (mean)
Time per request:       300.298 [ms] (mean)
Time per request:       3.003 [ms] (mean, across all concurrent requests)
Transfer rate:          30308.77 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.9      0      10
Processing:    20  287  47.4    296     352
Waiting:        8  272  46.1    280     338
Total:         29  288  45.7    296     355

Percentage of the requests served within a certain time (ms)
  50%    296
  66%    303
  75%    307
  80%    310
  90%    318
  95%    325
  98%    334
  99%    337
 100%    355 (longest request)